from PIL import Image

im = Image.open('data/Bomberman.png')
pixels = im.load() # список с пикселями
x, y = im.size # ширина (x) и высота (y) изображения

wight = [(255, 255, 255, 255),
         (224, 64, 136, 255),
         (248, 184, 144, 255),
         (224, 224, 224, 255),
         (176, 176, 176, 255),
         (96, 96, 96, 255),
         (0, 112, 248, 255),
         (0, 0, 184, 255),
         (200, 200, 200, 255),
         (200, 64, 136, 255),
         (0, 0, 0, 255),
         (0, 0, 0, 0)]

purple = [(255, 255, 255, 255),
          (239, 88, 0, 255),
          (243, 178, 112, 255),
          (120, 48, 201, 255),
          (67, 32, 127, 255),
          (23, 12, 43, 255),
          (75, 53, 136, 255),
          (53, 15, 79, 255),
          (242, 168, 98, 255),
          (173, 43, 0, 255),
          (0, 0, 0, 255),
          (0, 0, 0, 0)]

for i in range(x):
    for j in range(y):
        r, g, b, o = pixels[i, j]
        pixels[i, j] = purple[wight.index((r, g, b, o))]

im.save("data/Dan.png")